package by.htp.les02.tasks;

// Дан прямоугольник , ширина которого в 2 раза меньше длины. Найти площадь прямоугольника.

public class Task7 {
	public static void main(String[]args) {
		
		int a , b , c ;  // обьявление переменных
		
		a = 10;        // присвоение значений к переменным
		b = 20;
		
		c = b * a ;    // обьявляем переменную 'c' и находим её значение
		
		System.out.println("Площадь прямоугольника при длине "+b+ " и ширине "+a+ " = "+c); //вывод результата в консоль
	}

}
