package by.htp.les02.tasks;
// Найдите значение функции: c = 3 + a .

public class Task2 {
	public static void main(String[] args) {
		
		int a ,b, c; // обьявляем переменные
		a = 5;       // присваиваем значения переменным
		b = 3;
		c = b + a;
		
		System.out.println("Значение= "+c); // Выводим результат в консоль
	}
	

}
