package by.htp.les02.tasks;
// Дана сторона равностороннего треугольника.
//Найти площадь этого треугольника, его высоту, радиусы вписанной и описанной окружностей.

public class Task19 {
	public static void main(String[]args) {
		
		int a, s;
		
		a = 5;
		System.out.println("сторона равностороннего треугольника = "+a);
		
		s = a * 3;
		System.out.println("Площадь равностороннего треугольника = "+s);
	}

}
