package by.htp.les02.tasks;
// Найдите значение функции: z = 2*x +(y-2)*5

public class Task3 {
	public static void main(String[]args) {
		
		int a, b, c, x, y, z; // обьявление переменных
		
		a = 2;                // присвоение значений к переменным
		b = 5;
		c = 1;
		x = 3;
		y = 4;
		
		z = 2*x +(y-2)*5;  // обьявляем переменную 'z' и находим её значение
		
		System.out.println("Значение= "+ z); //вывод результата в консоль
		
	}

}
