package by.htp.les02.tasks;
// ƒаны 2 действительных числа x и y.¬ычислить их сумму, разность, произведение и частное.

public class Task1 {
	public static void main(String[] args) {
   
		
		int x = 7;  // обь€вл€ем переменные и значени€ к ним
		int y = 5;
		
		int z , a, b, c;  // обь€вл€ем переменные
		
		z = x + y;  // сложение переменных
		a = x - y;  // вычитание
		b = x / y;  // деление
		c = x * y;  // умножение
		
		System.out.println("—ложение= "+z+" вычитание= "+a+" деление= "+b+" умножение= "+c); // вывод результата в консоль
		
	}

}
